import doctest

"""
### Требования:

1. **Класс должен иметь конструктор `__init__`** с 2-3 параметрами, которые сохраняются в атрибуты объекта
2. **Реализовать валидацию** входных данных в конструкторе (проверка на допустимые значения)
3. **Добавить 2-3 метода** для описания поведения объекта
4. **Каждый метод должен иметь**:
   - Docstring с описанием параметров и возвращаемого значения
   - Аннотации типов для всех параметров и возвращаемого значения
5. **Реализовать валидацию** входных данных в методах (где это необходимо)
"""

# TODO Создайте свой класс по заданию

if __name__ == '__main__':
    doctest.testmod()